import random

X = []
for i in range(10):
    X.append(random.randint(1, 6))
print(X)


import numpy as np
import matplotlib.pyplot as plt
import random


N = 1000  # розмір вибірки
X = []  # Пустий масив для наповнення


# Цикл з 1000 ітерацій, на кожній з яких додаємо 1 випадковий цілочисельний елемент з імовірністю, рівномірно розподіленою від 1 до 6
for i in range(N):
    X.append(random.uniform(1, 6))


# формується 2 масиви: n - кількість елементів, що потрапили в інтервал, x - масив границь інтервалів
print(np.histogram(X, bins=5))
n, x = np.histogram(X, bins=5)


# масив початків інтервалів (прибрали останнє, найбільше значення)
xmin = x[:-1]


# ширина інтервалу (різниця двох послідовних стовпчиків)
dx = x[1] - x[0]


# емпірична приведена частота: частка від кількості елементів в інтервалі та загальної кількості елементів
y = n / N


# масив центрів інтервалів
xmid = xmin + dx / 2
# виводимо емпіричну гістограму приведених частот
plt.bar(xmid, y, width=dx, color="y")


# Виводимо підписи на осях
plt.xlabel("x")
plt.ylabel("Частота (ймовірність)")


# Малюємо сітку та гістограму.
plt.grid()
plt.show()
